{
    "projects": [
        {
            "id": 1,
            "name": "FinanzasApp",
            "description": "API REST completa para gestión de finanzas personales con FastAPI, PostgreSQL y despliegue en Heroku + Aiven. Incluye autenticación JWT, CRUD completo de transacciones y reportes financieros.",
            "image": "projects/financeIA.png",
            "url": "https://fastapi-finanzas-app-374b5c820ee8.herokuapp.com/docs",
            "skills": [
                "FastAPI",
                "PostgreSQL",
                "SQLAlchemy",
                "JWT",
                "Heroku",
                "Aiven",
                "Python",
                "Pydantic"
            ]
        },
        {
            "id": 3,
            "name": "Taskly-API",
            "description": "API de gestión de tareas con FastAPI y MySQL. Incluye operaciones CRUD avanzadas, sistema de autenticación robusto, documentación automática con Swagger y testing con pytest.",
            "image": "projects/tasklyApi.png",
            "url": "https://taskly-fastapi-app-839607d4d977.herokuapp.com/docs",
            "skills": [
                "FastAPI",
                "MySQL",
                "SQLAlchemy",
                "JWT",
                "Pytest",
                "Heroku",
                "Aiven",
                "Swagger"
            ]
        },
        {
            "id": 4,
            "name": "Ally360",
            "description": "projects.ally360.card",
            "image": "https://ally360-web.netlify.app/logo/Macbook_Pro_ally_login.svg",
            "url": "https://ally360.co/",
            "skills": [
                "React 19",
                "TypeScript",
                "Material UI",
                "Redux Toolkit",
                "RTK Query",
                "React Router",
                "Vite",
                "FastAPI",
                "PostgreSQL",
                "Redis",
                "MinIO",
                "Docker"
            ]
        },
        {
            "id": 5,
            "name": "ToDo App",
            "description": "Aplicación TODO que permite crear, editar, visualizar y cambiar de estado las tareas. construida en React, usando Custom-hooks para la persistencia de datos atraves del localstorage, React Context para el manejo del estado global y Chakra IU para la interfaz de usuario",
            "image": "/Task-App.png",
            "url": "https://github.com/DanielE0802/Todo-React",
            "skills": [
                "React.js",
                "HTML",
                "CSS",
                "JavaScript",
                "Chakra-UI",
                "Custom-Hooks",
                "React-Context"
            ]
        },
        {
            "id": 6,
            "name": "GIFOS",
            "description": "Aplicación web que funciona como un catálogo de GIFs, Diseñada en HTML, CSS, y JavaScript Vanilla por medio de la metodología SPA para lograr una mayor fluidez de la página, además de ser Mobile first y adaptado a todas las pantallas. Logrando funciones de búsqueda, interacción con una API externa utilizando asincróncronismo y aprovechando las herramientas nativas del navegador, como capturar imágenes a través de una cámara web.",
            "image": "/Gifos.png",
            "url": "https://daniele0802.github.io/Proyecto-GIFOS/",
            "skills": [
                "HTML",
                "CSS",
                "JavaScript",
                "API",
                "Mobile-First"
            ]
        }
    ],
    "detailedProjectInfo": [
        {
            "title": "FinanzasApp",
            "description": "API REST para gestión de finanzas personales",
            "detailedDescription": {
                "es": "FinanzasApp es una API REST completa desarrollada con FastAPI para la gestión integral de finanzas personales. Permite a los usuarios registrar ingresos, gastos, crear categorías personalizadas y generar reportes financieros detallados. La aplicación utiliza PostgreSQL como base de datos principal y está desplegada en Heroku con Aiven para la gestión de la base de datos.",
                "en": "FinanzasApp is a comprehensive REST API developed with FastAPI for comprehensive personal finance management. It allows users to record income, expenses, create custom categories, and generate detailed financial reports. The application uses PostgreSQL as the main database and is deployed on Heroku with Aiven for database management."
            },
            "challenges": {
                "es": [
                    "Implementación de autenticación JWT segura y renovación de tokens.",
                    "Optimización de consultas complejas para reportes financieros.",
                    "Configuración de despliegue en Heroku con base de datos externa en Aiven."
                ],
                "en": [
                    "Implementation of secure JWT authentication and token renewal.",
                    "Optimization of complex queries for financial reports.",
                    "Deployment configuration on Heroku with external database on Aiven."
                ]
            },
            "learnings": {
                "es": [
                    "Desarrollo avanzado con FastAPI y SQLAlchemy.",
                    "Gestión de bases de datos PostgreSQL en la nube.",
                    "Implementación de testing automatizado con pytest."
                ],
                "en": [
                    "Advanced development with FastAPI and SQLAlchemy.",
                    "PostgreSQL database management in the cloud.",
                    "Implementation of automated testing with pytest."
                ]
            },
            "image": "projects/financeIA.png",
            "tags": [
                "FastAPI",
                "PostgreSQL",
                "SQLAlchemy",
                "JWT",
                "Heroku",
                "Aiven",
                "Python"
            ],
            "link": "https://fastapi-finanzas-app-374b5c820ee8.herokuapp.com/docs",
            "link-github": "https://github.com/DanielE0802/Finance-IA"
        },
        {
            "title": "Taskly-API",
            "description": "API de gestión de tareas con FastAPI",
            "detailedDescription": {
                "es": "Taskly-API es una API REST desarrollada con FastAPI para la gestión avanzada de tareas y proyectos. Incluye funcionalidades como creación de tareas con prioridades, asignación a usuarios, seguimiento de progreso, notificaciones y generación de reportes de productividad. Utiliza MySQL como base de datos y está completamente documentada con Swagger.",
                "en": "Taskly-API is a REST API developed with FastAPI for advanced task and project management. It includes functionalities such as creating tasks with priorities, user assignment, progress tracking, notifications, and productivity report generation. It uses MySQL as database and is fully documented with Swagger."
            },
            "challenges": {
                "es": [
                    "Implementación de sistema de notificaciones en tiempo real.",
                    "Optimización de consultas para reportes de productividad.",
                    "Testing exhaustivo con pytest y cobertura de código."
                ],
                "en": [
                    "Implementation of real-time notification system.",
                    "Query optimization for productivity reports.",
                    "Comprehensive testing with pytest and code coverage."
                ]
            },
            "learnings": {
                "es": [
                    "Desarrollo de APIs REST con documentación automática.",
                    "Implementación de testing avanzado y TDD.",
                    "Gestión de bases de datos MySQL en la nube."
                ],
                "en": [
                    "Development of REST APIs with automatic documentation.",
                    "Implementation of advanced testing and TDD.",
                    "MySQL database management in the cloud."
                ]
            },
            "image": "projects/tasklyApi.png",
            "tags": [
                "FastAPI",
                "MySQL",
                "SQLAlchemy",
                "JWT",
                "Pytest",
                "Swagger"
            ],
            "link": "https://taskly-fastapi-app-839607d4d977.herokuapp.com/docs",
            "link-github": "https://github.com/DanielE0802/taskly-api"
        },
        {
            "title": "Ally360",
            "description": "Sistema ERP que permite la contabilidad, sistema POS.",
            "detailedDescription": {
                "es": "Ally360 es una plataforma SaaS (ERP + POS) para PYMES colombianas, enfocada en operaciones diarias y control del negocio: POS táctil multiventana, inventario multibodega, analítica y flujos de facturación/integración DIAN. Es un proyecto acreditado por Fondo Emprender, con base tecnológica sólida: frontend en React 19 + TypeScript + MUI (Redux Toolkit/RTK Query, React Router, React Hook Form + Yup), backend multi-tenant en FastAPI + PostgreSQL (JWT, aislamiento por tenant_id, jobs con Celery/Redis) y manejo de archivos con MinIO usando presigned URLs. También incluye un sitio público en Next.js (App Router) con MDX para blog y auditorías SEO/performance. La plataforma está dockerizada y preparada para despliegue con reverse proxy (Caddy) en servidor.",
                "en": "Ally360 is a SaaS platform (ERP + POS) for Colombian SMBs, focused on daily operations and business control: touch POS with multi-tab sales, multi-warehouse inventory, analytics, and invoicing/DIAN-ready flows. It is a Fondo Emprender accredited project with a solid technical foundation: a React 19 + TypeScript + MUI frontend (Redux Toolkit/RTK Query, React Router, React Hook Form + Yup), a multi-tenant FastAPI + PostgreSQL backend (JWT, strict tenant_id isolation, background jobs with Celery/Redis) and file handling via MinIO using presigned URLs. It also includes a public marketing website in Next.js (App Router) with an MDX-based blog and SEO/performance checks. The platform is dockerized and prepared for server deployment behind a reverse proxy (Caddy)."
            },
            "challenges": {
                "es": [
                    "Diseñar un backend multi-tenant con aislamiento estricto por empresa (tenant_id) y autorización por roles contextuales.",
                    "Construir un POS táctil multiventana manteniendo estado consistente, rendimiento y UX fluida en pantallas táctiles.",
                    "Definir contratos API estables para módulos (productos, inventario, tesorería/contabilidad) y mantener compatibilidad con el frontend.",
                    "Implementar manejo de archivos con MinIO usando presigned URLs (subida directa + confirmación) sin exponer archivos públicamente.",
                    "Preparar despliegue reproducible con Docker y reverse proxy (Caddy), cuidando variables de entorno y seguridad."
                ],
                "en": [
                    "Designing a multi-tenant backend with strict tenant_id isolation and context-based role authorization.",
                    "Building a touch-first, multi-tab POS while keeping state consistent, performant, and smooth.",
                    "Defining stable API contracts across modules (products, inventory, treasury/accounting) while staying compatible with the frontend.",
                    "Implementing MinIO file handling with presigned URLs (direct upload + confirmation) without exposing public files.",
                    "Preparing a reproducible deployment with Docker and a reverse proxy (Caddy), focusing on env config and security."
                ]
            },
            "learnings": {
                "es": [
                    "Arquitectura modular en frontend (feature/modules) con React + TypeScript y patrones de hooks para separar UI y lógica de negocio.",
                    "Gestión de estado y data-fetching con Redux Toolkit + RTK Query (cache, invalidación, y consistencia).",
                    "Buenas prácticas de multi-tenancy y seguridad en APIs (JWT, guards, rate limiting/caching con Redis).",
                    "Estrategias de rendimiento: code splitting, lazy loading y optimización de flujos críticos en POS.",
                    "SEO técnico en Next.js: metadata, sitemap/robots y contenido MDX para blog."
                ],
                "en": [
                    "Modular frontend architecture (feature/modules) with React + TypeScript and hook patterns to separate UI from business logic.",
                    "State management and data fetching with Redux Toolkit + RTK Query (caching, invalidation, consistency).",
                    "Multi-tenancy and API security best practices (JWT, guards, rate limiting/caching with Redis).",
                    "Performance strategies: code splitting, lazy loading, and optimizing critical POS flows.",
                    "Technical SEO in Next.js: metadata, sitemap/robots, and an MDX-based blog."
                ]
            },
            "image": "https://ally360-web.netlify.app/logo/Macbook_Pro_ally_login.svg",
            "tags": [
                "React 19",
                "TypeScript",
                "Material UI",
                "Redux Toolkit",
                "RTK Query",
                "React Router",
                "React Hook Form",
                "Yup",
                "Vite",
                "FastAPI",
                "PostgreSQL",
                "SQLAlchemy",
                "Alembic",
                "Redis",
                "Celery",
                "MinIO",
                "Docker",
                "Caddy",
                "Next.js",
                "MDX",
                "SEO"
            ],
            "link": "https://ally360.co/",
            "link-app": "https://app.ally360.co/auth/jwt/login",
            "link-api": "https://api.ally360.co/docs",
            "link-github": "https://github.com/ally-360/webapp-platform"
        },
        {
            "title": "Gifos",
            "description": "Buscador de Gifs",
            "detailedDescription": {
                "es": "Gifos es una aplicación web interactiva que permite a los usuarios buscar y visualizar GIFs animados utilizando la API de Giphy. El proyecto se centra en ofrecer una experiencia de usuario fluida y atractiva, con un diseño limpio y funcionalidades de búsqueda en tiempo real.",
                "en": "Gifos is an interactive web application that allows users to search and view animated GIFs using the Giphy API. The project focuses on providing a smooth and engaging user experience, with a clean design and real-time search functionalities."
            },
            "challenges": {
                "es": [
                    "Implementar un scroll infinito para cargar más resultados de forma eficiente.",
                    "Gestionar el estado de la aplicación de forma centralizada.",
                    "Asegurar un diseño responsive y adaptable a diferentes dispositivos."
                ],
                "en": [
                    "Implementing infinite scroll to efficiently load more results.",
                    "Managing the application state centrally.",
                    "Ensuring a responsive and adaptable design for different devices."
                ]
            },
            "learnings": {
                "es": [
                    "Uso avanzado de APIs REST.",
                    "Técnicas de optimización del rendimiento para la carga de imágenes.",
                    "Mejora en la gestión del estado en aplicaciones React."
                ],
                "en": [
                    "Advanced use of REST APIs.",
                    "Performance optimization techniques for image loading.",
                    "Improved state management in React applications."
                ]
            },
            "image": "/Gifos.png",
            "tags": [
                "React",
                "API",
                "CSS"
            ],
            "link": "https://gifos-dr.netlify.app/"
        },
        {
            "title": "Task App",
            "description": "Aplicación de Tareas",
            "detailedDescription": {
                "es": "Task App es una herramienta de gestión de tareas que permite a los usuarios crear, organizar y dar seguimiento a sus pendientes. La aplicación cuenta con funcionalidades para editar, eliminar y marcar tareas como completadas, todo ello con una interfaz intuitiva y minimalista.",
                "en": "Task App is a task management tool that allows users to create, organize, and track their to-dos. The application features functionalities to edit, delete, and mark tasks as completed, all with an intuitive and minimalist interface."
            },
            "challenges": {
                "es": [
                    "Persistencia de datos utilizando el almacenamiento local del navegador (Local Storage).",
                    "Creación de una interfaz de usuario interactiva para la manipulación de tareas.",
                    "Implementación de la lógica para filtrar y mostrar tareas."
                ],
                "en": [
                    "Data persistence using the browser's local storage.",
                    "Creating an interactive user interface for task manipulation.",
                    "Implementing the logic for filtering and displaying tasks."
                ]
            },
            "learnings": {
                "es": [
                    "Manipulación del DOM y gestión de eventos en JavaScript puro.",
                    "Conceptos de almacenamiento de datos en el lado del cliente.",
                    "Estructuración de un proyecto de JavaScript vanilla de forma modular."
                ],
                "en": [
                    "DOM manipulation and event management in pure JavaScript.",
                    "Concepts of client-side data storage.",
                    "Structuring a vanilla JavaScript project in a modular way."
                ]
            },
            "image": "/Task-App.png",
            "tags": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "link": "https://task-app-dr.netlify.app/"
        }
    ]
}